% https://blog.csdn.net/qq_43649786/article/details/98843408

a = zeros(1,5); %建立一个1*5的空矩阵用于储存f1(x)+g2(4-x)的结果
f1=[0 3 5 6 7 6 5];
f2=[0 4 6 7 8 9 10];
f3=[0 2 5 9 8 8 7];      %输入
s1 = zeros(1,5);        
s2 = zeros(1,5);        %分别建立两个1*5空矩阵储存f2(x)+f3(x)以及min（g2）
i = 0;
s = 0;
z = 0;
s3=[0,0,0];             %建立一个1*3空矩阵用于记录每一状态的最佳决策
while (i<=4)            %利用两个循环语句分别计算出min（g2）再与f1（x）相加   
    j=4-i;
    while(j>=0)       
        k=4-i-j;       
        s1(j+1)=f2(j+1)+f3(k+1);       
        if s1(j+1)>z         %利用if语句找到g2最小时对应的给2,3厂分配的设备数
            z=s1(j+1)        %最优解
            s3(2)=j;
            s3(3)=k;
            s3               %最优决策
        end       
        j=j-1;   
    end   
    s2(i+1)=max(s1);
    if s2(i+1)>s        %同理利用if语句找到f1（x）的最佳决策       
        s=s2(i+1);       
        s3(1)=i;
    end   
    s1=zeros(1,5);          %将s1置零记录下一次的g2的值   
    a(i+1) = f1(i+1)+s2(i+1);   
    i=i+1;
end