% 某公司经销甲产品。它下设三个加工厂。每日的产量分别是：
% A1位7吨，A2为4吨，A3为9吨。该公司把这些产品分别运往4个销售点。
% 各销售点的每日销量分别为：B1为3吨，B2为6吨，B3为5吨，B4为6吨，
% 已知运价如下表所示，问该公司如何调用产品，在满足各销地需求量的前提下，使总运费最少。 

% 产地A到销售地1234的运输量分别为x1,x2,x3,x4;产地B到销售地1234的运输量分别为x5,x6,x7,x8;C...
% minf(x)=3x1+11x2+3x3+...+5x12
% constraint:x1+x2+x3+x4=7; x5+...+x8=4; ...; x1+x5+x9=3; x2+x6+x10=6; ...
clc; clear
c=[3,11,3,10,1,9,2,8,7,4,10,5]; %cost
Aeq=[1,1,1,1,0,0,0,0,0,0,0,0;
     0,0,0,0,1,1,1,1,0,0,0,0;
     0,0,0,0,0,0,0,0,1,1,1,1;
     1,0,0,0,1,0,0,0,1,0,0,0;
     0,1,0,0,0,1,0,0,0,1,0,0;
     0,0,1,0,0,0,1,0,0,0,1,0;
     0,0,0,1,0,0,0,1,0,0,0,1]; 
beq=[7;4;9;3;6;5;6];
lb=[0;0;0;0;0;0;0;0;0;0;0;0];
ub=[Inf;Inf;Inf;Inf;Inf;Inf;Inf;Inf;Inf;Inf;Inf;Inf];
[x,fval]=linprog(c,[],[],Aeq,beq,lb,ub) % x是目标函数取得最小值的一组变量的值; fval是优化结束后得到的的目标函数
% c为由目标函数系数构成的向量, aeq和beq构成了线性规划的等式约束条件aeq*x=beq
% lb和ub为约束变量的下界与上界向量

% sol: 最后当x分别为x1...x12时, 运输总费用最小, 为fval

% function x = ys(a,beq)%先输入右侧列向量，再输入下面向量
% [m,n]=size(a);
% aeq=zeros(m+n,m*n);
% for i=1:m
%     for j=1:n
%         aeq(i,(i-1)*n+j)=1;
%     end    
% end
% for i=m+1:m+n
%     for j=1:m
%         aeq(i,(j-1)*n+i-m)=1;
%     end
% end
% c=zeros(1,m*n);
% for i=1:m
%     for j=1:n
%         c(1,(i-1)*n+j)=a(i,j);
%     end
% end
% lb=zeros(m*n,1);
% ub=zeros(m*n,1);
% for i=1:m*n
%     ub(i,1)=Inf;
% end
% [b,fval]=linprog(c,[],[],aeq,beq,lb,ub);
% x=zeros(m,n);
% for i=1:m
%     for j=1:n
%        x(i,j)=b((i-1)*n+j,1);
%     end
% end

% a=[3 11 3 10;1 9 2 8;7 4 10 5]
% a =
%      3    11     3    10
%      1     9     2     8
%      7     4    10     5
% >> b=[7 4 9 3 6 5 6]
% b =
%      7     4     9     3     6     5     6
% >> ys(a,b)
% 
% Optimal solution found.
% 
% ans =
%      0     0     5     2
%      3     0     0     1
%      0     6     0     3